src/compatibility/chrono/data/precice/flap_openfoam/fluid_openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice_config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface1
  {
    mesh              FluidMesh;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
      Displacement
    );
    
    writeData
    (
      Force
    );
  };
};

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1000;
}
